web/flask-gevent-test/benchmark.txt
wrk -t12 -c400 -d30s http://127.0.0.1:8081/test

This runs a benchmark for 30 seconds, using 12 threads, and keeping 400 HTTP connections open.
30s
12threads
400 connections/second

gunicorn + gevent + flask
Running 30s test @ http://127.0.0.1:8081/test
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.56ms  143.25ms   1.84s    68.26%
    Req/Sec   115.95     82.21   525.00     71.40%
  40719 requests in 30.11s, 6.65MB read
  Socket errors: connect 0, read 569, write 40, timeout 279
  Non-2xx or 3xx responses: 171
Requests/sec:   1352.35
Transfer/sec:    226.20KB


gunicorn + flask
Running 30s test @ http://127.0.0.1:8081/test
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   110.12ms   39.30ms 396.76ms   87.88%
    Req/Sec    94.01     60.18   410.00     71.15%
  16398 requests in 30.06s, 2.58MB read
  Socket errors: connect 179, read 1478, write 100, timeout 0
Requests/sec:    545.57
Transfer/sec:     87.91KB

gunicorn + meinheld